Boren-Z/stm32-furuta-inverted-pendulum/Hardware/PWM.c
#include "stm32f10x.h"                  // Device header

/**
  * @brief  PWM pins initialization (Multiplexed push-pull output)
  * @param  None
  * @retval None
  */
void PWM_Init(void)
{
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode 	= GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin 	= GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Speed 	= GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM2);
	
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;
	TIM_TimeBaseInitStructure.TIM_ClockDivision 	= TIM_CKD_DIV1;
	TIM_TimeBaseInitStructure.TIM_CounterMode 		= TIM_CounterMode_Up;
	TIM_TimeBaseInitStructure.TIM_Period 			= 100 - 1;	// ARR: 2MHz/100 = 20kHz -> 0.05ms update
	TIM_TimeBaseInitStructure.TIM_Prescaler 		= 36 - 1;	// PSC: 72MHz/36 = 2MHz
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);
	
	TIM_OCInitTypeDef TIM_OCInitStructure;
	TIM_OCStructInit(&TIM_OCInitStructure);
	TIM_OCInitStructure.TIM_OCMode 		= TIM_OCMode_PWM1;
	TIM_OCInitStructure.TIM_OCPolarity	= TIM_OCPolarity_High;
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInitStructure.TIM_Pulse 		= 0;				// CCR
	
	TIM_OC1Init(TIM2, &TIM_OCInitStructure);
	
	TIM_Cmd(TIM2, ENABLE);
}

/**
  * @brief  Set the TIM2 CCR1 compare value (duty = Compare / ARR, ARR = 100)
  * @param  Compare CCR1 value, 0 to 100
  * @retval None
  */
void PWM_SetCompare1(uint16_t Compare)
{
	TIM_SetCompare1(TIM2, Compare);
}
